In [1]:
import pandas as pd
import sqlite3

In [17]:
con = sqlite3.connect("switrs.sqlite")

In [ ]:
collisions = pd.read_sql_query('SELECT * FROM collisions', con)
collisions

In [ ]:
collisions.info()

In [4]:
coll_query = '''SELECT DISTINCT (alcohol_involved) FROM collisions'''
pd.read_sql_query(coll_query, con)

   alcohol_involved
0               NaN
1               1.0

In [ ]:
coll_query = '''SELECT COUNT(DISTINCT(county_city_location)) FROM collisions'''
pd.read_sql_query(coll_query, con)

In [ ]:
collisions2 = pd.read_sql_query('SELECT COUNT(*) FROM collisions', con)
collisions2
#collisions['county_city_location']

In [13]:
coll_query = '''SELECT DISTINCT (state_route) FROM collisions'''
pd.read_sql_query(coll_query, con)

     state_route
0            NaN
1           15.0
2            5.0
3           82.0
4          805.0
..           ...
246          0.0
247        209.0
248        274.0
249        153.0
250        252.0

[251 rows x 1 columns]

In [14]:
collisions.head(5)

   COUNT (*)
0    9172565

In [15]:
collisions.count()

COUNT (*)    1
dtype: int64

In [ ]:
collisions.info()

In [ ]:
collisions['column_new'] = collisions['alcohol_involved'].str.split(',') 
collisions['column_new'].head()